per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input("Вводите сумму:"))
TKB = int((per_cent['ТКБ']) * (money/100))
SKB = int((per_cent['СКБ']) * (money/100))
VTB = int((per_cent['ВТБ']) * (money/100))
SBER = int((per_cent['СБЕР']) * (money/100))

deposit = [TKB, SKB, VTB, SBER]
print("Накопленные средства за год в каждом из банков =", deposit)
#Добавьте в программу поиск максимального значения и его вывод на экран
print("Максимальная сумма, которую вы можете заработать:", max(deposit))
print(per_cent)





C:\Python\python.exe C:\Users\Татьяна\PycharmProjects\12.7\12.7f.py 
Вводите сумму: 200000
Накопленные средства за год в каждом из банков = [11200, 11800, 8560, 8000]
Максимальная сумма, которую вы можете заработать: 11800
{'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}

Process finished with exit code 0
